In [ ]:
#Reshaping
import pandas as pd
import numpy as np

In [ ]:
data = pd.date_range('20210101', periods=6)
df = pd.DataFrame(np.random.randn(6,4), index=data, columns= ['var A', 'var B','var C', 'var D'])

In [ ]:
df

               var A     var B     var C     var D
2021-01-01 -1.736261 -0.750036  0.033968  0.128910
2021-01-02 -0.536540  1.917684  0.865210 -0.098973
2021-01-03 -1.910097 -0.480833  1.479405 -2.107353
2021-01-04  0.363428 -1.749453  0.067801  0.402400
2021-01-05  0.066980  2.003139 -0.181882 -0.713084
2021-01-06  0.373238  0.891897  0.719527  0.204767

In [ ]:
# transformar as datas em colunas - traspor - transformando linha em colula
dft =df.T
dft

       2021-01-01  2021-01-02  2021-01-03  2021-01-04  2021-01-05  2021-01-06
var A   -1.736261   -0.536540   -1.910097    0.363428    0.066980    0.373238
var B   -0.750036    1.917684   -0.480833   -1.749453    2.003139    0.891897
var C    0.033968    0.865210    1.479405    0.067801   -0.181882    0.719527
var D    0.128910   -0.098973   -2.107353    0.402400   -0.713084    0.204767

In [ ]:
dft.shape

(4, 6)

In [ ]:
df.shape

(6, 4)

In [ ]:
#visualizando os valores do data frame
v = dft.values
v

array([[-1.73626142, -0.53654031, -1.91009748,  0.36342759,  0.06697978,
         0.37323831],
       [-0.75003589,  1.91768434, -0.48083274, -1.74945297,  2.00313858,
         0.89189683],
       [ 0.03396785,  0.86520969,  1.47940495,  0.06780146, -0.18188161,
         0.71952694],
       [ 0.12891016, -0.09897331, -2.10735298,  0.4023996 , -0.71308365,
         0.20476721]])

In [ ]:
# reshape
v.reshape((2,12))

array([[-1.73626142, -0.53654031, -1.91009748,  0.36342759,  0.06697978,
         0.37323831, -0.75003589,  1.91768434, -0.48083274, -1.74945297,
         2.00313858,  0.89189683],
       [ 0.03396785,  0.86520969,  1.47940495,  0.06780146, -0.18188161,
         0.71952694,  0.12891016, -0.09897331, -2.10735298,  0.4023996 ,
        -0.71308365,  0.20476721]])

In [ ]:
# função PIVOT
dias = pd.date_range(start='20160101', periods=12)
dias

DatetimeIndex(['2016-01-01', '2016-01-02', '2016-01-03', '2016-01-04',
               '2016-01-05', '2016-01-06', '2016-01-07', '2016-01-08',
               '2016-01-09', '2016-01-10', '2016-01-11', '2016-01-12'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
Pessoa = ['Danielly', 'Marcia', 'Lucia']

In [ ]:
# escolher pessoa de forma aleatoria
np.random.choice(Pessoa)

'Danielly'

In [ ]:
# cria função de gasto e o np.round arredonda a quantidade de casas decimais
nome = []
gasto = []
for i in range(12):
  nome.append (np.random.choice(Pessoa))
  gasto.append(np.round(np.random.randn()*100,2))

In [ ]:
gasto

[-78.36,
 -8.49,
 45.47,
 -19.54,
 155.78,
 27.8,
 61.84,
 -20.37,
 76.75,
 53.69,
 24.58,
 135.78]

In [ ]:
df2 = pd.DataFrame({'dia':dias, 'nome': nome, 'gasto': gasto})

In [ ]:
df2

          dia      nome   gasto
0  2016-01-01     Lucia  -78.36
1  2016-01-02    Marcia   -8.49
2  2016-01-03     Lucia   45.47
3  2016-01-04    Marcia  -19.54
4  2016-01-05  Danielly  155.78
5  2016-01-06    Marcia   27.80
6  2016-01-07  Danielly   61.84
7  2016-01-08     Lucia  -20.37
8  2016-01-09     Lucia   76.75
9  2016-01-10    Marcia   53.69
10 2016-01-11    Marcia   24.58
11 2016-01-12    Marcia  135.78

In [ ]:
# função PIVOT
df2.pivot(index='dia', columns='nome', values='gasto')

nome        Danielly  Lucia  Marcia
dia
2016-01-01       NaN -78.36     NaN
2016-01-02       NaN    NaN   -8.49
2016-01-03       NaN  45.47     NaN
2016-01-04       NaN    NaN  -19.54
2016-01-05    155.78    NaN     NaN
2016-01-06       NaN    NaN   27.80
2016-01-07     61.84    NaN     NaN
2016-01-08       NaN -20.37     NaN
2016-01-09       NaN  76.75     NaN
2016-01-10       NaN    NaN   53.69
2016-01-11       NaN    NaN   24.58
2016-01-12       NaN    NaN  135.78

In [ ]:
#pivot table mais abrangente aceita numeros fracionados
df2.pivot_table(index='dia', columns='nome', values='gasto')

nome        Danielly  Lucia  Marcia
dia
2016-01-01       NaN -78.36     NaN
2016-01-02       NaN    NaN   -8.49
2016-01-03       NaN  45.47     NaN
2016-01-04       NaN    NaN  -19.54
2016-01-05    155.78    NaN     NaN
2016-01-06       NaN    NaN   27.80
2016-01-07     61.84    NaN     NaN
2016-01-08       NaN -20.37     NaN
2016-01-09       NaN  76.75     NaN
2016-01-10       NaN    NaN   53.69
2016-01-11       NaN    NaN   24.58
2016-01-12       NaN    NaN  135.78

In [ ]:
# seleção de linhas e colunas 
datas2=pd.date_range('20150101',periods=600, freq='D')
df3 = pd.DataFrame(np.random.randn(600,5), index = datas2, columns=list('ABCDE'))

In [ ]:
df3.head(2)

                   A         B         C         D         E
2015-01-01 -0.998907  0.014386 -0.833885 -0.332171  0.586323
2015-01-02  0.102685  0.938870  0.683354  0.589913  1.166193

In [ ]:
# obter todas as informações df3['D']
df3['D'].head(3)

2015-01-01   -0.332171
2015-01-02    0.589913
2015-01-03    1.500308
Freq: D, Name: D, dtype: float64

In [ ]:
df3.head(5)

                   A         B         C         D         E
2015-01-01 -0.998907  0.014386 -0.833885 -0.332171  0.586323
2015-01-02  0.102685  0.938870  0.683354  0.589913  1.166193
2015-01-03 -0.867617  0.023997 -1.691339  1.500308  1.560667
2015-01-04  1.242142 -2.273332 -2.029672 -0.008212  1.595275
2015-01-05 -0.825060  1.142048 -0.485406 -1.416424  0.051378

In [ ]:
# seleção 1 linha e 5 colunas
df3[1:5]

                   A         B         C         D         E
2015-01-02  0.102685  0.938870  0.683354  0.589913  1.166193
2015-01-03 -0.867617  0.023997 -1.691339  1.500308  1.560667
2015-01-04  1.242142 -2.273332 -2.029672 -0.008212  1.595275
2015-01-05 -0.825060  1.142048 -0.485406 -1.416424  0.051378

In [ ]:
# especificar um conjunto de dados
df3.loc[:,['A','C','D']]

                   A         C         D
2015-01-01 -0.998907 -0.833885 -0.332171
2015-01-02  0.102685  0.683354  0.589913
2015-01-03 -0.867617 -1.691339  1.500308
2015-01-04  1.242142 -2.029672 -0.008212
2015-01-05 -0.825060 -0.485406 -1.416424
...              ...       ...       ...
2016-08-18 -0.356291 -1.064756 -0.302963
2016-08-19 -0.383835  0.709457 -0.248846
2016-08-20 -1.128795  0.449787  0.865578
2016-08-21  0.939763  0.792592  1.669044
2016-08-22  0.243781 -0.731096  0.474238

[600 rows x 3 columns]

In [ ]:
l = df3.loc['20150401':'20151009', ['B', 'D']]

In [ ]:
# ver tamanho do conjunto
len(l)

192

In [ ]:
l = df3.loc['20150401':'20151009', ['B', 'D']].head(3)
l

                   B         D
2015-04-01 -0.551643  1.092979
2015-04-02 -0.985416  0.141045
2015-04-03  0.231970 -0.116054

In [ ]:
# selecionar linha
df3.iloc[1]

A    0.102685
B    0.938870
C    0.683354
D    0.589913
E    1.166193
Name: 2015-01-02 00:00:00, dtype: float64

In [ ]:
df3.iloc[2:4,0:2]

                   A         B
2015-01-03 -0.867617  0.023997
2015-01-04  1.242142 -2.273332

In [ ]:
df3.iloc[[1,5,6],[0,3]]

                   A         D
2015-01-02  0.102685  0.589913
2015-01-06 -0.865699 -0.985893
2015-01-07 -1.353021 -1.571980

In [ ]:
df3.iloc[1:3,:]

                   A         B         C         D         E
2015-01-02  0.102685  0.938870  0.683354  0.589913  1.166193
2015-01-03 -0.867617  0.023997 -1.691339  1.500308  1.560667